# Создайте словарь person, в котором будут присутствовать ключи name, age, city.
# Выведите значение возраста из словаря person.
person = {'name': 'Nadezda', 'age': 22, 'city': 'Minsk'}
print(person['age'])

