# Создание формы регистрации на веб-сайте. Есть поле имени (длина более 3 символов), кароче 4 не идет.
# Написать код, чтобы принимать имя в качестве входных данных и вызывать исключение, если имя не если действительно и что-то если действительно.
# использовать конструкция try - raise - except
# name = input('Введите свое Имя:')
# try:
#     if len(name) < 4:
#         raise "Имя оказалось короче допустимого!"
# except:
#     print("Ваше Имя оказалось короче допустимого!")
# else:
#     print("Спасибо за регистрацию")

# name = input('Введите свое Имя:')
# try:
#     if len(name) >= 4:
#         print('Аккаунт создан')
#     else:
#         raise "Имя оказалось короче допустимого!"
# except:
#     print("Ваше Имя оказалось короче допустимого!")
  
print(print(1) or 2, 3 and print(4))