# Создайте функцию, которая будет считать сумму чисел в диапазоне (0,9).
def summa():
    return (sum(range(1, 9)))


print(summa())
