# Создать множество.
# Создать неизменяемое множество.
# Выполнить операцию объединения созданных множеств.
# Выполнить операцию пересечения созданных множеств.
a = {1, 5, 7, 3, 'd', 9, 's'}
b = frozenset([15, 7, 'f', 12])
print(a|b)
print(a&b)


