# Вывести данные кортежа без скобок, через запятую. 
# Обязательно: элементы кортежа – строки.
a = ('И', 'все-таки', 'мир', 'прекрасен')
print(', '.join(a))

