# Дан списко кортежей. Написать программу, которая меняет последнее значение элемента кортежей.

list_1 = [(1, 2, 3), (4, 5, 6), (7, 8, 9)]
a = []
for i in list_1:
    i = list(i)
    i[-1] = 0
    a.append(tuple(i))
print(a)